---
kind: enumMember
id: F:Autodesk.Revit.DB.AttachmentType.Attachment
enum: Autodesk.Revit.DB.AttachmentType
source: html/1656f19c-da78-adae-59f2-e1821b1600ef.htm
---
# Autodesk.Revit.DB.AttachmentType.Attachment

The link is an attachment. If the host file is linked into
 another file, the link will also be brought along.